with t1 as (select 省份,
                   市                   as `地市`,
                   count(distinct 工号) as `人数`
            from db1.no_standards_0201_0229 where 省份 = '陕西' and 区  != '未知'
            group by 省份, 市),
t2 as (
select 省份,
       地市,
       人数,
       concat('1月-装移修超时预警-',省份,'省',地市,'市（0101-0107）') as `预警工单标题`,
       concat(省份,'省',地市,'地市分公司本月截至1月14日，共计',人数,'人装机当日通率≤省分T-1月完成值且修障当日好率≤省分T-1月完成值，请重点关注。') as `详细描述`,
'1、建议重点关注装机修交付时长，建立超时工单预警机制，加强中台异常订单监控调度。 2、强化服务标准宣贯执行，培训落实到人。3、地市公司客服人员协同专业部门核查分析研判，按照附件工作表中相关要求落实反馈。' as `改进建议`,
'预警人员问题情况落实改善，指标完成情况稳步提升' as `预期目标`
from t1),
    t3 as(select 省份,
                   count(distinct 工号) as `人数`
            from db1.no_standards_0201_0229 where 省份 = '陕西' and 区  != '未知'
            group by 省份),
    t4 as ( select 省份,
       '陕西省分公司' as 地市,
       人数,
       concat('1月-装移修超时预警-',省份,'省分公司','（0101-0107）') as `预警工单标题`,
       concat(省份,'省分公司本月截至1月14日，共计',人数,'人装机当日通率≤省分T-1月完成值且修障当日好率≤省分T-1月完成值，请重点关注。') as `详细描述`,
'1、建议重点关注装机修交付时长，建立超时工单预警机制，加强中台异常订单监控调度。 2、强化服务标准宣贯执行，培训落实到人。3、地市公司客服人员协同专业部门核查分析研判，按照附件工作表中相关要求落实反馈。' as `改进建议`,
'预警人员问题情况落实改善，指标完成情况稳步提升' as `预期目标`
from t3 )
select * from t2
union all
select * from t4
;


select 省份,
                   市                   as `地市`,
                   count(distinct 工号) as `人数`
            from db1.no_standards_0201_0229 where 省份 = '湖北' and 区  != '未知'
            group by 省份, 市;