      select
  compl_prov,
  xiufu_liang,
  guzhang_liang
from
  (
    select
      a.compl_prov,
      count(
        distinct if (
          cast(
            a.nature_accpet_len + a.nature_audit_dist_len + a.nature_veri_proce_len + a.nature_result_audit_len as int
          ) <= 4 * 60 * 60,
          a.sheet_id,
          0
        )
      ) as xiufu_liang,
      count(distinct a.sheet_id) as guzhang_liang
    from
      dc_dwa.dwa_d_sheet_main_history_chinese a
    where
      a.month_id in ('${hiveconf:start_day_id}')
      and (
        a.is_over = 1
        or a.sheet_status = 7
      ) -- 取办结的工单
      and a.serv_content not like ('%测试%')
      and (
        (
          a.pro_id = 'N2'
          and a.customer_pro = '11'
          and a.serv_type_name like '%故障工单%'
          and a.accept_channel in ('17', '24')
          and (
            a.serv_content like '%专线%'
            or a.serv_content like '%互联网%'
            or a.serv_content like '%数据及网元%'
            or a.serv_content like '%数字电路%'
            or a.serv_content like '%固网数据%'
            or a.serv_content like '%网元%'
            or a.serv_content like '%SDH%'
            or a.serv_content like '%MPLS%'
            or a.serv_content like '%VPN%'
            or a.serv_content like '%MSTP%'
            or a.serv_content like '%DDN%'
            or a.serv_content like '%FR%'
            or a.serv_content like '%ATM%'
            or a.serv_content like '%数字传输%'
            or a.serv_content like '%以太网%'
            or a.serv_content like '%虚拟专用网%'
            or a.serv_content like '%电路编号%'
            or a.serv_content like '%电路号%'
            or a.serv_content like '%故障号%'
            or a.serv_content like '%中断%'
            or a.serv_content like '%不通%'
            or a.serv_content like '%丢包%'
          )
          and (
            a.serv_content not like '%宽带%'
            or a.serv_content not like '%固话%'
            or a.serv_content not like '%IPTV%'
            or a.serv_content not like '%光猫%'
            or a.serv_content not like '%猫%'
            or a.serv_content not like '%路由器%'
            or a.serv_content not like '%通话%'
            or a.serv_content not like '%语音%'
            or a.serv_content not like '%非专线%'
            or a.serv_content not like '%不是专线%'
            or a.serv_content not like '%非故障%'
            or a.serv_content not like '%不是故障%'
            or a.serv_content not like '%快速专线%'
            or a.serv_content not like '%专线状态正常%'
            or a.serv_content not like '%直达专线%'
            or a.serv_content not like '%公交专线%'
            or a.serv_content not like '%网格%'
            or a.serv_content not like '%极光%'
            or a.serv_content not like '%商务快车%'
            or a.serv_content not like '%商务动车%'
            or a.serv_content not like '%智享专车%'
            or a.serv_content not like '%商车%'
            or a.serv_content not like '%（需求）%'
          )
        )
        or (
          a.pro_id in ('N1', 'N2', 'S1', 'S2')
          and a.customer_pro != '11'
          and a.serv_type_name like ('%10019故障工单%')
          and a.accept_channel in ('17', '24')
        )
      )
      and a.is_delete = '0'
      and a.pro_id not in ('AJ', 'AS')
    group by
      a.compl_prov
  ) t1
where
  compl_prov is not null;



10019故障工单

分子口径A:取以下工单标签处理时长不超过4小时的工单数量：

'10019故障工单>>数据及网元>>线路中断',
'10019故障工单>>数据及网元>>线路瞬断',
'10019故障工单>>数据及网元>>线路丢包',
'10019故障工单>>数据及网元>>延时增大',
'10019故障工单>>数据及网元>>其他',
'10019故障工单>>互联网业务>>网络中断',
'10019故障工单>>互联网业务>>单一地址无法访问',
'10019故障工单>>互联网业务>>邮件收发',
'10019故障工单>>互联网业务>>网速慢',
'10019故障工单>>互联网业务>>通网***方向网速慢',
'10019故障工单>>互联网业务>>某游戏/软件应用问题',
'10019故障工单>>互联网业务>>访问某网站丢包严重',
'10019故障工单>>互联网业务>>访问某网站延时',
'10019故障工单>>互联网业务>>其他',
'10019专用工单目录>>故障工单（2021版）>>数据及网元>>线路中断',
'10019专用工单目录>>故障工单（2021版）>>数据及网元>>线路瞬断',
'10019专用工单目录>>故障工单（2021版）>>数据及网元>>线路丢包',
'10019专用工单目录>>故障工单（2021版）>>数据及网元>>延时增大',
'10019专用工单目录>>故障工单（2021版）>>数据及网元>>其他',
'10019专用工单目录>>故障工单（2021版）>> 互联网业务>>网络中断',
'10019专用工单目录>>故障工单（2021版）>> 互联网业务>>单一地址无法访问',
'10019专用工单目录>>故障工单（2021版）>> 互联网业务>>邮件收发',
'10019专用工单目录>>故障工单（2021版）>> 互联网业务>>网速慢',
'10019专用工单目录>>故障工单（2021版）>> 互联网业务>>通网***方向网速慢',
'10019专用工单目录>>故障工单（2021版）>> 互联网业务>>某游戏/软件应用问题',
'10019专用工单目录>>故障工单（2021版）>> 互联网业务>>访问某网站丢包严重',
'10019专用工单目录>>故障工单（2021版）>> 互联网业务>>访问某网站延时',
'10019专用工单目录>>故障工单（2021版）>> 互联网业务>>其他',
'10019专用工单目录>>故障工单（2021版）>>数据及网元',
'10019专用工单目录>>故障工单（2021版）>> 互联网业务',
'故障工单（2021版）>>宽带>>【网络使用】宽带网络>>专线/电路障碍'
其中处理时长= 受理自然时长+核查处理自然时长+审核派发自然时长+结果审核自然时长（取故障归属省）


统计周期双线故障工单数量



+-----------------+-----------+----------------+---------------+-------------+-----------------------+-----------------+-----------------+-----------------------+---------------+---------------+-----------------+--------------+----------------------------------------------------+----------------------+----------------------+------------+----------+--------------+------------+-------------+--------------------+------------------------+------------------------+--------------------------+-----------+---------------+
| accept_channel  | month_id  |  serv_type_id  | customer_pro  | compl_area  |       sheet_no        | serv_type_id_1  |     busi_no     |       cust_name       | sheet_status  | urgent_level  | important_type  | record_file  |          last_deal_content                  |     accept_time      |    archived_time     | woyygzfen  | woyygzd  |is_out_time  | deal_time  | dabiao_len  | nature_accpet_len  | nature_audit_dist_len  | nature_veri_proce_len  | nature_result_audit_len  | hccl_cnt  | result_check  |
+-----------------+-----------+----------------+---------------+-------------+-----------------------+-----------------+-----------------+-----------------------+---------------+---------------+-----------------+--------------+----------------------------------------------------+----------------------+----------------------+------------+----------+--------------+------------+-------------+--------------------+------------------------+------------------------+--------------------------+-----------+---------------+
| 17              | 202307    | S1_1901020201  | 74            | 0739        | GZ202307111125456211  | S1_1901020201  | 792YTW12958268  | 武冈市土地储备**             | 7             | 03            | 03              |              | 多次回访用户无法接通2023071118472234948143S1，工号DN62005423，此单闭环 | 2023-07-11 11:25:45  | 2023-07-11 18:48:33 | NULL       | NULL     | 是            | 22434      | NULL        | 0                  | 448                    | 21888                  | 98                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020201  | 74            | 0739        | GZ202307100822115114  | S1_1901020201  | 15630196632     | 中国**                  | 7             | 03            | 03              |              | 多次回访用户无法接通202307110953256948143S1，工号DN62005423，此单闭环 | 2023-07-10 08:22:11  | 2023-07-11 09:56:21  | NULL       | NULL     | 是            | 45832      | NULL        | 0                  | 134                    | 45610                | 88                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020101  | 74            | 0731        | GZ202307041115095756  | S1_1901020101  | 15207499622     | 湖南恒昌医药集团有限**          | 7             | 01            | 01              |  | 多次联系用户无法接通，2023070413493621847807S1，账号DNKH220372，此单闭环 | 2023-07-04 11:15:09  | 2023-07-04 13:51:27  | NULL       | NULL     | 否            | 5217       | NULL        | 0                  | 231  | 4897                   | 89                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020101  | 74            | 0731        | GZ202307080132045378  | S1_1901020101  | 073188969666    | 武汉市七天酒店管理有限公司长沙红星分**  | 7             | 01            | 4               |          | 已回访用户，用户表示正在处理当中，有现场有工作人员，后续有问题再致电，2023070812052868347807S1，账号DNKH220372，用户表示问题已解决，满意，及时联系。      | 2023-07-08 01:32:05  | 2023-07-08 12:09:11  | NULL       | NULL  | 是            | 36242      | NULL        | 0                  | 124                    | 36089                  | 29                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020101  | 74            | 0731        | GZ202307101147176868  | S1_1901020101  | 714ALY008722    | 中电数科科技有限**            | 7             | 01            | 4               || 已解决：已回访用户2023071012144690348143S1，工号DN62005423，用户表示问题已解决，满意，及时联系 | 2023-07-10 11:47:18  | 2023-07-10 12:16:12  | NULL       | NULL     | 否            | 1485       | NULL        | 0                  | 209                    | 1149                   | 127                      | NULL      | NULL          |
| 17              | 202307    | S1_1901020201  | 74            | 0731        | GZ202307101137136784  | S1_1901020201  | 15675833733     | 卓尔发展(长沙)有限**          | 7             | 03            | 02              || 已解决：已回访用户2023071012022540248143S1，工号DN62005423，用户表示问题已解决，满意，及时联系 | 2023-07-10 11:37:13  | 2023-07-10 12:03:30  | NULL       | NULL     | 否            | 1370       | NULL        | 0                  | 99                     | 1169                   | 102                      | NULL      | NULL          |
| 17              | 202307    | S1_1901020201  | 74            | 0731        | GZ202307031445436894  | S1_1901020201  | 741DIA005724    | 上海衡翔网络科技有限**          | 7             | 03            | 02              |  | 已解决：已回访用户2023070315362864948143S1，工号DN62005423，用户表示问题已解决，满意，及时联系 | 2023-07-03 14:45:44  | 2023-07-03 15:37:43  | NULL       | NULL     | 否            | 3024       | NULL        | 0                  | 204                    | 2622                   | 198                      | NULL      | NULL          |
| 17              | 202307    | S1_1901020101  | 74            | 0736        | GZ202307121149595827  | S1_1901020101  | 18600224082     | 王**                   | 7             | 01            | 4               |              | 多次联系用户无法接通，2023071213413694847807S1，账号DNKH220372，此单闭环 | 2023-07-12 11:49:59  | 2023-07-12 13:44:00  |NULL       | NULL     | 否            | 2167       | NULL        | 0                  | 159                    | 1900                   | 108                      | NULL      | NULL          |
| 17              | 202307    | S1_1901020101  | 74            | 0736        | GZ202307121544217346  | S1_1901020101  | 15133890192     | 汉寿县龙潭桥营销**            | 7             | 03            | 03              || 已解决，已回访用户，2023071216185258147807S1，账号DNKH220372，用户表示问题已解决，满意，及时联系。 | 2023-07-12 15:44:21  | 2023-07-12 16:20:44  | NULL       | NULL     | 否            | 1902       | NULL        | 0 | 335                    | 1468                   | 99                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020101  | 74            | 0732        | GZ202307131534396978  | S1_1901020101  | 15873225455     | 湘乡一汽大众4S店             | 7             | 03            | 03              |              | 多次回访用户无法接通2023071412361727248143S1，工号DN62005423，此单闭环 | 2023-07-13 15:34:41  | 2023-07-14 12:37:35 | NULL       | NULL     | 是            | 71485      | NULL        | 0                  | 208                    | 71257                  | 20                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020201  | 74            | 0738        | GZ202307141008126382  | S1_1901020201  | 07388959999     | 新化县飞扬艺术培训**           | 7             | 03            | 02              | | 多次联系用户无法接通，2023071413060194647807S1，账号DNKH220372，此单闭环 | 2023-07-14 10:08:12  | 2023-07-14 13:07:30  | NULL       | NULL     | 否            | 5995       | NULL        | 0                  | 223 | 5712                   | 60                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020101  | 74            | 0731        | GZ202307171107256861  | S1_1901020101  | 741SDH017321    | 中企网络通信技术有限公司广州分**     | 7             | 01            | 4               |       | 已解决，已回访用户，2023071713051629347807S1，账号DNKH220372，用户表示问题已解决，满意，及时联系。 | 2023-07-17 11:07:25  | 2023-07-17 13:06:57  | NULL       | NULL     | 否            | 6756       | NULL        | 0        | 119                    | 6539                   | 98                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020201  | 74            | 0731        | GZ202307170937366050  | S1_1901020201  | 18600224082     | 中国**                  | 7             | 01            | 4               |              | 多次联系用户无法接通，2023071715020174947807S1，账号DNKH220372，此单闭环 | 2023-07-17 09:37:36  | 2023-07-17 15:03:23  |NULL       | NULL     | 否            | 14307      | NULL        | 0                  | 477                    | 13785                  | 45                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020201  | 74            | 0731        | GZ202307010915325985  | S1_1901020201  | 073108511575    | 长沙市岳麓区好润家楚济堂大**       | 7             | 03            | 03              |     | 此单有误非专线，以此单为准，GZ202307010944426299，工号DNKH220372    | 2023-07-01 09:15:32  | 2023-07-01 09:46:46  | NULL       | NULL     | 否            | 1776       | NULL        | 0                  | 53| 1296                   | 427                      | NULL      | NULL          |
| 17              | 202307    | S1_1901020201  | 74            | 0735        | GZ202307261702307412  | S1_1901020201  | 15115511651     | 宜章县赤石乡卫**             | 7             | 01            | 4               |              | 多次联系用户无法接通，2023072618340078147807S1，账号DNKH220372，此单闭环 | 2023-07-26 17:02:32  | 2023-07-26 18:37:33  | NULL       | NULL     | 否            | 1412       | NULL        | 0                  | 119                    | 1253                   | 40                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020101  | 74            | 0731        | GZ202307261056427412  | S1_1901020101  | 073108660103    | 湖南行道物业发展有限**          | 7             | 01            | 4               |  | 多次联系用户无法接通，2023072615321316347807S1，账号DNKH220372，此单闭环     | 2023-07-26 10:56:42  | 2023-07-2615:34:56  | NULL       | NULL     | 否            | 13281      | NULL        | 0                  | 364      | 12870                  | 47                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020101  | 74            | 0731        | GZ202307241952337305  | S1_1901020101  | 741HLW073761    | 上海菲信通信服务股份有限**        | 7             | 03            | 03              |    | 已解决，已回访用户，2023072508125293747807S1，账号DNKH220372，用户表示问题已解决，满意，及时联系。         | 2023-07-24 19:52:33  | 2023-07-25 08:15:46  | NULL       | NULL     | 否            | 2733       | NULL        | 0             | 113                    | 2580                   | 40                       | NULL      | NULL |
| 17              | 202307    | S1_1901020103  | 74            | 0731        | GZ202307180041236780  | S1_1901020103  | 540YLW001361    | 荣耀终端有限**              | 7             | 03            | 03              |              |多次回访用户无法接通202307180932386448143S1，工号DN62005423，此单闭环 | 2023-07-18 00:41:24  | 2023-07-18 09:34:07  | NULL       | NULL     | 是            | 22719      | NULL        | 0                  | 41                     | 22654                  | 24                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020201  | 74            | 0735        | GZ202307300934185425  | S1_1901020201  | 13617350669     | 中国福利**                | 7             | 01            | 4               |              | 多次回访用户无法接通2023073014115969448143S1，工号DN62005423，此单闭环 | 2023-07-30 09:34:18  | 2023-07-30 14:13:30  |NULL       | NULL     | 否            | 10189      | NULL        | 0                  | 145                    | 9985                   | 59                       | NULL      | NULL          |
| 17              | 202307    | S1_1901020101  | 74            | 0731        | GZ202307201208025608  | S1_1901020101  | 073108219052    | 湖南卫康士健康产业有限**         | 7             | 01            | 4               |   | 已解决：已回访用户2023072012501177048143S1，工号DN62005423，用户表示问题已解决，满意，及时联系 | 2023-07-20 12:08:02  | 2023-07-20 12:51:44  | NULL       | NULL     | 否            | 2044       | NULL        | 0| 147                    | 1795                   | 102                      | NULL      | NULL          |
| 17              | 202307    | S1_1901020201  | 74            | 0731        | GZ202307200959056984  | S1_1901020201  | 073108219052    | 湖南卫康士健康产业有限**         | 7             | 01            | 4               |   | 已解决：已回访用户2023072010221134348143S1，工号DN62005423，用户表示问题已解决，满意，及时联系 | 2023-07-20 09:59:05  | 2023-07-20 10:24:05  | NULL       | NULL     | 否            | 1018       | NULL        | 0| 106                    | 796                    | 116                      | NULL      | NULL          |
| 17              | 202307    | S1_1901020201  | 74            | 0731        | GZ202307210925165943  | S1_1901020201  | 741DIA005069    | 湖南湘江鲲鹏信息科技有限责任**      | 7             | 03            | 02              |      | 多次联系用户无法接通，2023072113191840647807S1，账号DNKH220372，此单闭环 | 2023-07-21 09:25:16  | 2023-07-2113:20:18  | NULL       | NULL     | 否            | 9526       | NULL        | 0                  | 209      | 9199                   | 118                      | NULL      | NULL          |
+-----------------+-----------+----------------+---------------+-------------+-----------------------+-----------------+-----------------+-----------------------+---------------+---------------+-----------------+--------------+----------------------------------------------------+----------------------+----------------------+------------+----------+--------------+------------+-------------+--------------------+------------------------+------------------------+--------------------------+-----------+---------------+
