
create table fwbz.qyc_0611 as
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 全国 as index_value,'全国' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 北京 as index_value,'北京' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 天津 as index_value,'天津' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 河北 as index_value,'河北' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 山西 as index_value,'山西' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 内蒙古 as index_value,'内蒙古' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 辽宁 as index_value,'辽宁' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 吉林 as index_value,'吉林' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 黑龙江 as index_value,'黑龙江' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 山东 as index_value,'山东' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 河南 as index_value,'河南' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 上海 as index_value,'上海' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 江苏 as index_value,'江苏' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 浙江 as index_value,'浙江' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 安徽 as index_value,'安徽' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 福建 as index_value,'福建' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 江西 as index_value,'江西' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 湖北 as index_value,'湖北' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 湖南 as index_value,'湖南' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 广东 as index_value,'广东' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 广西 as index_value,'广西' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 海南 as index_value,'海南' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 重庆 as index_value,'重庆' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 四川 as index_value,'四川' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 贵州 as index_value,'贵州' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 云南 as index_value,'云南' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 西藏 as index_value,'西藏' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 陕西 as index_value,'陕西' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 甘肃 as index_value,'甘肃' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 青海 as index_value,'青海' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 宁夏 as index_value,'宁夏' as pro_name from fwbz.qyc0612 union all
select `一级-按服务分类`, `二级-专业大类`, `三级-专业小类`, `四级-场景`, `五级-标准`, `六级-指标`, 是否应用于五大窗口, 重要程度, 指标编码, 指标类型, 目标值达标规则, `2024年-目标值`, 指标单位, 版主, 是否线下提供, 计算公式, 填写账期, `四级-场景_2`, `五级-标准_2`, `六级-指标_2`, `四-六级综合权重`, 新疆 as index_value,'新疆' as pro_name from fwbz.qyc0612;


select * from fwbz.qyc_0611;
select * from fwbz.qyc0612;
-- todo 导入 hive










