set hive.mapred.mode = nonstrict;
set mapreduce.job.queuename = q_dc_dw;
desc dc_dwa.dwa_d_sheet_main_history_chinese;

select sheet_no, compl_prov_name, compl_area_name, serv_content, serv_type_name, archived_time
from dc_dwa.dwa_d_sheet_main_history_chinese
where month_id = '202403'
  and serv_type_name in (
                         '10019投诉工单>>业务开通问题>>业务开通未按照合同约定速率',
                         '10019投诉工单>>业务开通问题>>业务开通进度提前',
                         '10019投诉工单>>业务开通问题>>业务开通进度滞后',
                         '10019投诉工单>>业务开通问题>>欠停要求开通',
                         '10019投诉工单>>业务开通问题>>要求提前开通',
                         '10019投诉工单>>账单问题>>账单中显示的功能费与实际订购不符',
                         '10019投诉工单>>账单问题>>账单中显示的费用与详单不符',
                         '10019投诉工单>>账单问题>>账单中格式显示问题',
                         '10019投诉工单>>账单问题>>账单中没有显示客户使用相关业务的费用',
                         '10019投诉工单>>账单问题>>账单收不到',
                         '10019投诉工单>>计收费问题>>协议到期产生费用争议',
                         '10019投诉工单>>计收费问题>>实际扣费情况与商机宣传不一致',
                         '10019投诉工单>>计收费问题>>延迟销户',
                         '10019投诉工单>>计收费问题>>托收问题',
                         '10019投诉工单>>计收费问题>>拆户、报停后仍产生各种费用',
                         '10019投诉工单>>计收费问题>>未使用但产生费用',
                         '10019投诉工单>>计收费问题>>未按合同标准资费计收',
                         '10019投诉工单>>计收费问题>>线路应有的优惠或免费资源未享受',
                         '10019投诉工单>>计收费问题>>线路月租计收不正确',
                         '10019投诉工单>>计收费问题>>资费包未及时生效',
                         '10019投诉工单>>计收费问题>>退费问题',
                         '10019投诉工单>>计收费问题>>销账问题',
                         '10019投诉工单>>人员服务问题>>客户经理服务问题'
    );


