set hive.mapred.mode = nonstrict;
set mapreduce.job.queuename = q_dc_dw;



select serv_type_name,sheet_no,proc_name,busno_prov_name,serv_content,archived_time,is_shensu,month_id,day_id
from dc_dwa.dwa_d_sheet_main_history_chinese
where serv_type_name in (
                         '投诉工单（2021版）>>移网>>【产品及计费使用】计交费及发票>>电子发票获取不便捷/不成功',
                         '投诉工单（2021版）>>融合>>【产品及计费使用】计交费及发票>>电子发票获取不便捷/不成功',
                         '投诉工单（2021版）>>宽带>>【产品及计费使用】计交费及发票>>电子发票获取不便捷/不成功',
                         '投诉工单（2021版）>>移网>>【产品及计费使用】计交费及发票>>发票不明晰看不懂',
                         '投诉工单（2021版）>>宽带>>【产品及计费使用】计交费及发票>>发票不明晰看不懂',
                         '投诉工单（2021版）>>融合>>【产品及计费使用】计交费及发票>>发票不明晰看不懂',
                         '投诉工单（2021版）>>移网>>【产品及计费使用】计交费及发票>>手厅无法打开发票页面',
                         '投诉工单（2021版）>>融合>>【产品及计费使用】计交费及发票>>手厅无法打开发票页面',
                         '投诉工单（2021版）>>宽带>>【产品及计费使用】计交费及发票>>手厅无法打开发票页面',
                         '投诉工单（2021版）>>移网>>【产品及计费使用】计交费及发票>>无法打印发票、额度不足等',
                         '投诉工单（2021版）>>融合>>【产品及计费使用】计交费及发票>>无法打印发票、额度不足等',
                         '投诉工单（2021版）>>宽带>>【产品及计费使用】计交费及发票>>无法打印发票、额度不足等'
    ) and month_id = '202401'